{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/global_average_pooling1d_10_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_20_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_20_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_21_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_21_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_10_1/embedding_10_1/Cast", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_10_1/embedding_10_1/Cast", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_10_1/embedding_10_1/Less", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/add", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/SelectV2", "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/global_average_pooling1d_10_1/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2", "StatefulPartitionedCall/sequential_10_1/global_average_pooling1d_10_1/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_20_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10_1/global_average_pooling1d_10_1/Mean", "StatefulPartitionedCall/sequential_10_1/dense_20_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/dense_20_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_21_1/Sigmoid", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_10_1/dense_20_1/Relu", "StatefulPartitionedCall/sequential_10_1/dense_21_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_10_1/dense_21_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "U2lnbW9pZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_10_1/dense_21_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/ReadVariableOp", "shape": [10000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10_1/embedding_10_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10_1/global_average_pooling1d_10_1/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_20_1/Cast/ReadVariableOp", "shape": [64, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_20_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_21_1/Cast/ReadVariableOp", "shape": [64, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_10_1/dense_21_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32"}]}]}